app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises" WHERE ("exercises"."id" = 1) LIMIT 1
---
  def show
    @exercise = Exercise.find(params[:id])

INSERT INTO "exercises" ("created_by", "section", "title", "article", "upvotes", "downvotes", "created_at", "updated_at", "user_id") VALUES (NULL, 'Testing', 'fooodayedtof', 'alikgh laitkhld dejf fjdher ,y fhagfi.', NULL, NULL, '2011-04-10 19:18:46.488746', '2011-04-10 19:18:46.488746', 1)
---
  def create
    @exercise = current_user.exercises.create(params[:exercise])

SELECT "exercises".* FROM "exercises" WHERE ("exercises"."id" = 1) LIMIT 1
---
  def edit
    @exercise = Exercise.find(params[:id])

SELECT "exercises".* FROM "exercises" WHERE ("exercises"."id" = 1) LIMIT 1
UPDATE "exercises" SET "article" = 'Lorem Ipsum...updated!', "updated_at" = '2011-02-04 17:46:22.823108' WHERE ("exercises"."id" = 1)
---
  def update
    @exercise = Exercise.find(params[:id])
    if @exercise.update_attributes(params[:exercise])

SELECT "exercises".* FROM "exercises" WHERE ("exercises"."id" = 1) LIMIT 1
UPDATE "exercises" SET "upvotes" = 1, "updated_at" = '2011-04-28 02:40:30.866753' WHERE ("exercises"."id" = 1)
---
  def upvote
		@exercise = Exercise.find(params[:id])
		@exercise.upvotes+=1
		if(@exercise.save)

SELECT "exercises".* FROM "exercises" WHERE ("exercises"."id" = 1) LIMIT 1
UPDATE "exercises" SET "downvotes" = 1, "updated_at" = '2011-04-28 02:58:04.877774' WHERE ("exercises"."id" = 1)
---
  def downvote
		@exercise = Exercise.find(params[:id])
		@exercise.downvotes+=1
		if(@exercise.save)