app/controllers/tutorials_controller.rb

SELECT "tutorials".* FROM "tutorials" WHERE ("tutorials".user_id = 1)
---
  def index

	@tutorials = Tutorial.all

SELECT "tutorials".* FROM "tutorials" WHERE ("tutorials"."id" = 1) LIMIT 1
---
  def show
    @tutorial = Tutorial.find(params[:id])

INSERT INTO "tutorials" ("created_by", "section", "title", "article", "upvotes", "downvotes", "user_id", "created_at", "updated_at") VALUES (0, NULL, 'A Great Title', 'This is a submission which will blow your mind and baffle your britches.', 0, 0, 1, '2011-04-28 02:32:51.031995', '2011-04-28 02:32:51.031995')
---
  def create

		@tutorial = current_user.tutorials.create(params[:tutorial])

SELECT "tutorials".* FROM "tutorials" WHERE ("tutorials"."id" = 1) LIMIT 1
DELETE FROM "tutorials" WHERE ("tutorials"."id" = 1)
---
  def destroy
    @tutorial = Tutorial.find(params[:id])
    @tutorial.destroy

SELECT "tutorials".* FROM "tutorials" WHERE ("tutorials"."id" = 3) LIMIT 1
UPDATE "tutorials" SET "upvotes" = 4, "updated_at" = '2011-04-28 02:20:03.690609' WHERE ("tutorials"."id" = 3)
---
  def upvote
		@tutorial = Tutorial.find(params[:id])
		@tutorial.upvotes+=1
		if(@tutorial.save)

SELECT "tutorials".* FROM "tutorials" WHERE ("tutorials"."id" = 1) LIMIT 1
UPDATE "tutorials" SET "downvotes" = 1, "updated_at" = '2011-04-28 02:50:12.289318' WHERE ("tutorials"."id" = 1)
---
  def downvote
		@tutorial = Tutorial.find(params[:id])
		@tutorial.downvotes+=1
		if(@tutorial.save)